In [1]:
import pandas as pd
from sklearn import tree

In [2]:
df = pd.read_csv('shop data.csv')

In [8]:
df.head(3)

     age income gender m_status buys
0    <25   high   male   single   no
1    <25   high   male  married   no
2  25-35   high   male   single  yes

In [4]:
# iloc x, y divided
x = df.iloc[:, :-1] #last 1 column deleted

In [9]:
x.head(3)

     age income gender m_status
0    <25   high   male   single
1    <25   high   male  married
2  25-35   high   male   single

In [6]:
# iloc x, y divided
y = df.iloc[:, 4] #first 3 column deleted

In [10]:
y.head(3)

0     no
1     no
2    yes
Name: buys, dtype: object

# Label Encoding